<!DOCTYPE HTML PUBLIC "-//W3C//DTD HTML 4.01 Transitional//EN"
"http://www.w3.org/TR/html4/loose.dtd">
<html>
<head>
<title>MuViBee Handbuch</title>
<meta http-equiv="Content-Type" content="text/html; charset=iso-8859-1">
</head>

<body>
<a name="top"></a><h1>
Handbuch zur Verwendung von MuViBee</h1>
<h2><img src="screenshot.png" width="700" height="417" border="0" usemap="#Map" align="right">
  <map name="Map">
    <area shape="rect" coords="15,26,288,53" href="#">
    <area shape="rect" coords="581,27,690,54" href="#">
    <area shape="rect" coords="15,59,292,78" href="#">
    <area shape="rect" coords="19,79,691,378" href="#">
    <area shape="rect" coords="12,384,695,405" href="#">
  </map>
1. Vorwort</h2>
	 <p>Der Name MuViBee stammt aus der umgangssprachlichen Abk&uuml;rzung von <strong>Music Video Bibliothek</strong>. Zum	Anderen hilft das flei&szlig;ige Bienchen einem beim Finden von B&uuml;chern, Musik und Videos.</p>
	 <p>Ziel der Software ist es, jeder Altersklasse eine einfache und intuitive Medienverwaltung zu erm&ouml;glichen, ohne gro&szlig;e PC Kenntnisse vorauszusetzen.</p>
	 <p>&nbsp;</p>
	 <h2>
     2. Programm&uuml;bersicht</h2>
	 <h3 align="left">Die Benutzerobefl&auml;che ist in f&uuml;nf Bereiche gegliedert.</h3>
	 <ol>
       <li><a href="#search">das Suchfeld</a></li>
       <li><a href="#tabs">die Kategorie Tabs</a></li>
       <li><a href="#main">das Hauptfenster </a></li>
       <li><a href="status">die Statusleite</a></li>
       <li><a href="#optional">zus&auml;tzliche Optionen </a></li>
</ol>
	 <h3>&nbsp;</h3>
	 <h3>2.1. das Suchfeld</h3>
	 <p>Geben Sie einfach einen Begriff im Suchfeld ein und klicken Sie anschlie&szlig;end auf &quot;Suchen&quot;. Das flei&szlig;ige Bienchen wird Ihnen umgehend alle Ergebnisse im <a href="#main">Hauptfenster</a> anzeigen. Sollte Ihre Suche ohne Ergebnis oder nicht passend genug ausfallen, klicken Sie mit der linken Maustaste auf das Feld &quot;<a href="#advanced_search">Erweiterte Suche</a>&quot;.<a href="#top">[zur&uuml;ck zum Seitenanfang</a>] </p>
	 <p>&nbsp;</p>
	 <h3>2.2. die Kategorie Tabs</h3>
	 <p><img src="tabs.png" width="290" height="23"><br>
     Um die Software stets &uuml;bersichtlich zu halten, ist das <a href="#main">Hauptfenster</a> in verschiedene Tabs / Reiter gegliedert, wie man es auch von Karteikarten kennt. Den Tab &quot;Wiederherstellen gel&ouml;schter Elemente&quot; k&ouml;nnen Sie sich wie einen Papierkorb vorstellen. Hier haben Sie die M&ouml;glichkeit ausversehen gel&ouml;schte Elemente wiederherzustellen. <a href="#top">[zur&uuml;ck zum Seitenanfang</a>] </p>
	 <p>&nbsp;</p>
	 <h3>2.3. das Hauptfenster</h3>
	 <p>Bei der Verwendung von MuViBee arbeiten Sie haupts&auml;chlich im Hauptfenster. Hier erhalten Sie eine &Uuml;bersichtlich Ihrer einzelnen Medien.<br>
	   Im oberen Bereich k&ouml;nnen Sie nach verschiedenen Optionen sortieren.<br>
	   Im unteren Bereich finden Sie den Button &quot;Hinzuf&uuml;gen&quot;. Je nachdem in welchem Tab Sie sich nun befinden, k&ouml;nnen Sie ein neues Medium hinzuf&uuml;gen. Nach dem Klick auf &quot;Hinzuf&uuml;gen&quot; k&ouml;nnen Sie nun ausw&auml;hlen, ob Sie das Medium mit Hilfe der <a href="#EAN">EAN / ISBN</a> anlegen wollen oder manuell. Bei der Verwendung von<a href="#EAN"> EAN / ISBN</a>, ben&ouml;tigen Sie jedoch eine aktive Internetverbindung. <a href="#top">[zur&uuml;ck zum Seitenanfang</a>] </p>
	 <p>&nbsp;</p>
	 <h3>2.2. die Statusleiste</h3>
	 <p>In der Statusleiste erhalten Sie stest alle Meldungen, wie "erfolgreich gespeichert", oder eine Fehlermeldung.</p>
	 <p>&nbsp;</p>
	 <h3>2.2. zus&auml;tzliche Optionen </h3>
	 <p>Hier k&ouml;nnen Sie zum Einen die Sprache Ihrer Benutzeroberfl&auml;che &auml;ndern, diese Hilfe aufrufen oder Informationen zum aktuellen Softwarestand abrufen.</p>
	 <p>&nbsp;</p>
	 <p align="left">&nbsp;</p>
	 <h2 align="left">3. Funktionen</h2>
	 <ol>
	   <li>Medium anlegen
	     <ol>
	       <li>per ISBN / EAN</li>
           <li>manuell </li>
	     </ol>
	   </li>
       <li>Erweiterte Suche</li>
       <li>Wiederherstellen gel&amp;ouml;schter Elemente</li>
</ol>
	 <h3>&nbsp;</h3>
	 <h3>3.1 Medium anlegen </h3>
	 <h3>3.1.1. per EAN / ISBN anlegen </h3>
	 <p>In sofern Sie &uuml;ber eine aktive Internetverbindung verf&uuml;gen, k&ouml;nnen Sie mit Hilfe der auf B&uuml;chern befindlichen ISBN Nummer, bzw. der auf allen Medien befindlichen EAN Nummer, bequem per Internet alle Informationen zu Ihrem Medium anlegen. Das flei&szlig;ige Bienchen f&uuml;gt Ihnen dann alle Informationen zum Produkt hinzu. Anschlie&szlig;end k&ouml;nnen Sie einzelne Angaben bearbeiten. Sie sparen sich dadurch aber das manuelle Anlegen. </p>
	 <h3>3.1.2.  manuell</h3>
	 <p>Sollte das automatische Anlegen fehlschlagen oder nicht m&ouml;glich sein, haben Sie weiterhin die M&ouml;glichkeit Ihr Medium manuell anzulegen. Nach der Auswahl &quot;manuell&quot; &ouml;ffnet sich im rechten Bereich des Hauptfensters ein Formular um Ihr Medium von Hand anzulegen. </p>
	 <p>&nbsp;</p>
	 <h3><img src="advanced_search.png" width="350" height="211" align="right">3.2. die erweiterte Suche </h3>
	 <p>Mit Hilfe der erweiterten Suche ist es m&ouml;glich, gezielt nach einzelnen Eigenschaften zu suchen. Beispielsweise nur Videos, Musik oder B&uuml;cher.<br>
	   Dar&uuml;ber hinaus verf&uuml;gt die erweiterte Suche &uuml;ber eine so genannte Volltextsuche. Das bedeutet, dass Sie nie den vollst&auml;ndigen Titel eingeben m&uuml;ssen. Angenommen Sie haben die Filme &quot;

 
       P.S. Ich liebe Dich  &quot; und &quot;

 
       Liebe braucht keine Ferien&quot; in Ihrem Datenbestand. Wenn Sie nun im Titel einfach &quot;Liebe&quot; eingeben, da Ihnen der vollst&auml;ndige Name nicht mehr bekannt ist, werden Ihnen nun diese beiden Filme als Ergebenis angezeigt. </p>
	 <p>&nbsp;</p>
	 <h3>3.3. Wiederherstellen gel&ouml;schter Elemente </h3>
	 <p>&nbsp;</p>
	 <p align="left">&nbsp;</p>
<p align="left">&nbsp;</p>
</body>
</html>
